===
ls
===
(1 2
 3)
---
(k (list (seq (n (intv)) (n (int1)))))

===
ls*
===
(1 2
3)
---
(k k: (list (seq (map f: (n (intv)) (ERROR) a: (n (int1))))))

===
nb1
===
foo:+/ /hi
---
(k k: (ass v: (n (var)) a: (avd f: (v) a: (a))) (nb))

===
nb2
===
(1  /one
 2) /two
---
(k (list (seq (n (int1)) (nb) (n (int1)))) (nb))

===
nb3
===
+  /oh
:+ /ok
---
(k (v) (nb) (exp (v)) (nb))
